# linux常用命令
# ls     列出目录内容
# pwd    显示当前工作目录
# cd     切换目录
# ps     显示当前进程信息状态
# du     显示每个文件和目录的磁盘使用空间~~~文件的大小
# df     显示磁盘分区上可以使用的磁盘空间
# free   可以显示Linux系统中空闲的、已用的物理内存及swap内存,及被内核使用的buffer
# chmod  控制用户对文件的权限的命令
# cp     拷贝文件或目录
# mv     移动文件或目录，或者改名
# mkdir  创建目录
# rm     删除文件或目录
# touch  修改文件或者目录的时间属性，包括存取时间和更改时间。若文件不存在，系统会建立一个新的文件
# cat    连接文件并打印到标准输出设备上
# grep   查找文件里符合条件的字符串
# tail   查看文件的内容，有一个常用的参数 -f 常用于查阅正在改变的日志文件。
# tail -f filename 会把 filename 文件里的最尾部的内容显示在屏幕上，并且不断刷新，只要 filename 更新就可以看到最新的文件内容。