'''
a= ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']

------顺序取值
a[:] = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']

------列表切片,取值a[n]到a[m-1]
a[1:4] = ['1', '2', '3']

------当n缺省时，默认为0，即a[:m]
a[:4] = ['0', '1', '2', '3']

------当m缺省时，默认到最后，即a[n:]
a[1:] = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']

------a[i:j:s]这种格式呢，i,j与上面的一样，但s表示步进，缺省为1，s可以取任何数字
a[1:5:2] = ['1', '3']

------从末尾倒数取值：
a[:5:-1] = ['12', '11', '10', '9', '8', '7', '6']

------从a[n]处倒数取值：
a[5::-2] = ['5', '3', '1']

------倒数取值：
a[::-1] = ['12', '11', '10', '9', '8', '7', '6', '5', '4', '3', '2', '1', '0']

------倒数取值：
a[::-2] = ['12', '10', '8', '6', '4', '2', '0']
'''

a = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']
print("a= " + str(a))
print("\r\n------顺序取值")
print("a[:] = " + str(a[:]))
print("\r\n------列表切片,取值a[n]到a[m-1]")
print("a[1:4] = " + str(a[1:4]))
print("\r\n------当n缺省时，默认为0，即a[:m]")
print("a[:4] = " + str(a[:4]))
print("\r\n------当m缺省时，默认到最后，即a[n:]")
print("a[1:] = " + str(a[1:]))
print("\r\n------a[i:j:s]这种格式呢，i,j与上面的一样，但s表示步进，缺省为1，s可以取任何数字")
print("a[1:5:2] = " + str(a[1:5:2]))
print("\r\n------从末尾倒数取值：")
print("a[:5:-1] = " + str(a[:5:-1]))
print("\r\n------从a[n]处倒数取值：")
print("a[5::-2] = " + str(a[5::-2]))
print("\r\n------倒数取值：")
print("a[::-1] = " + str(a[::-1]))
print("\r\n------倒数取值：")
print("a[::-2] = " + str(a[::-2]))
# pop,删除列表最后一个元素并返回该元素
print("a.pop() = " + a.pop())
print("after pop, a = " + str(a))
""" List基本使用
更新列表:
    list1[0] = 'D'   # 修改元素值
    list1.append('E') # 列表添加元素
    list1.insert(0 , 'F') # 在某处插入元素
删除:
del list1[0]       # 删除元素，0为index
list1.remove('1')  # 移除第一次出现的元素
list1.pop()        # 移出元素，默认从最后移出，返回该元素值；括号中可加入元素索引值来移除
"""

